# Procesamiento de datos
## Fes Aragon
### ICO
#### Kareli Alvarez Valle

In [2]:
import pandas as pd
import numpy as np

In [6]:
s = pd.Series({'a': 10, 'b': 20, 'c': 30}) #
print(type(s))
s

<class 'pandas.core.series.Series'>

a    10
b    20
c    30
dtype: int64

In [10]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [7]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [9]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
s1.max()

40

In [14]:
s1.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [25]:
# Generamos numeros aleat
s2 = pd.Series(np.random.randn(5))
s2

0   -2.295783
1   -2.064182
2    0.073270
3    0.743346
4   -0.892157
dtype: float64

In [27]:
s2

0   -2.295783
1   -2.064182
2    0.073270
3    0.743346
4   -0.892157
dtype: float64

In [28]:
s3 = pd.Series([[10, 20],\
                [30, 40.5,'series'],\
                [50, 55],\
                {'Name':'Tess','Org':'Packt'}])

s3

0                            [10, 20]
1                  [30, 40.5, series]
2                            [50, 55]
3    {'Name': 'Tess', 'Org': 'Packt'}
dtype: object

In [32]:
s3.describe()

count            4
unique           4
top       [10, 20]
freq             1
dtype: object

In [33]:
s3[1][1]

40.5

In [37]:
df = pd.DataFrame([30,50,20])
print(type(df))
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
(3, 1)

In [38]:
df

    0
0  30
1  50
2  20

In [39]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [40]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [41]:
list(df.index)

[0, 1, 2]

In [42]:
print("las columnas del df son: ", list(df.columns))
print("los indices de df son: ", list(df.index))

las columnas del df son:  [0]
los indices de df son:  [0, 1, 2]

In [43]:
df.columns = ["c1"]
df.index = ["r1", "r2", "r3"]
df

    c1
r1  30
r2  50
r3  20

In [44]:
df["c1"]

r1    30
r2    50
r3    20
Name: c1, dtype: int64

In [45]:
df["c1"]["r1"]

30

In [46]:
l = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data= l)
print(df1.shape)
df1

(4, 3)

   0  1  2
0  0  1  2
1  1  2  3
2  4  5  6
3  7  8  9

In [48]:
l1 = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9,10)]
df12 = pd.DataFrame(data= l1)
df12

   0  1  2     3
0  0  1  2   NaN
1  1  2  3   NaN
2  4  5  6   NaN
3  7  8  9  10.0

In [49]:
l = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data= l, columns = ["c1", "c2", "c3"], index = ["r1", "r2", "r3", "r4"])
df1

    c1  c2  c3
r1   0   1   2
r2   1   2   3
r3   4   5   6
r4   7   8   9

In [50]:
df1.describe()

             c1        c2        c3
count  4.000000  4.000000  4.000000
mean   3.000000  4.000000  5.000000
std    3.162278  3.162278  3.162278
min    0.000000  1.000000  2.000000
25%    0.750000  1.750000  2.750000
50%    2.500000  3.500000  4.500000
75%    4.750000  5.750000  6.750000
max    7.000000  8.000000  9.000000

In [51]:
df12.describe()

              0         1         2     3
count  4.000000  4.000000  4.000000   1.0
mean   3.000000  4.000000  5.000000  10.0
std    3.162278  3.162278  3.162278   NaN
min    0.000000  1.000000  2.000000  10.0
25%    0.750000  1.750000  2.750000  10.0
50%    2.500000  3.500000  4.500000  10.0
75%    4.750000  5.750000  6.750000  10.0
max    7.000000  8.000000  9.000000  10.0

In [54]:
d = {'py101':[10, 5, 33 ,45, 25, 22], 
                'py111':[0, 15, 21 , 30, 31, 11], 
                'py121':[15, 5, 1 ,10, 42, 21], 
                'py301':(20, 35, 3 ,15, 0, 0), }
meses = ('enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio')

df4 = pd.DataFrame(data = d, index = meses)

df4

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [57]:
m = np.arange(9).reshape(3,3)
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [59]:
df5 = pd.DataFrame(m, index = ["r1","r2","r3"], columns = ["c1",2,"c3"])
df5

    c1  2  c3
r1   0  1   2
r2   3  4   5
r3   6  7   8

In [60]:
df5.columns

Index(['c1', 2, 'c3'], dtype='object')

In [61]:
d

{'py101': [10, 5, 33, 45, 25, 22],
 'py111': [0, 15, 21, 30, 31, 11],
 'py121': [15, 5, 1, 10, 42, 21],
 'py301': (20, 35, 3, 15, 0, 0)}

In [62]:
df6 = pd.DataFrame(data=d, index=meses, columns=['mesas', 'sillas', 'bancos', 'puertas']) 
#se debe hacer el renombramiento por separado
df6

        mesas sillas bancos puertas
enero     NaN    NaN    NaN     NaN
febrero   NaN    NaN    NaN     NaN
marzo     NaN    NaN    NaN     NaN
abril     NaN    NaN    NaN     NaN
mayo      NaN    NaN    NaN     NaN
junio     NaN    NaN    NaN     NaN

In [63]:
df7 = pd.DataFrame(d, index=meses)
df7

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [65]:
df7.columns = ['BD', "TEBD", 'UML', 'JAVA']
df7

         BD  TEBD  UML  JAVA
enero    10     0   15    20
febrero   5    15    5    35
marzo    33    21    1     3
abril    45    30   10    15
mayo     25    31   42     0
junio    22    11   21     0

In [78]:
df7.rename(columns={'UML':'SI', 'JAVA':'POO'}, inplace=True)
df7

       BD  TEBD  SI  POO
enero  10     0  15   20
feb     5    15   5   35
marzo  33    21   1    3
abril  45    30  10   15
may    25    31  42    0
junio  22    11  21    0

In [79]:
df7.rename(index = {'febrero':'feb', 'mayo':'may'}, inplace =True)
df7

       BD  TEBD  SI  POO
enero  10     0  15   20
feb     5    15   5   35
marzo  33    21   1    3
abril  45    30  10   15
may    25    31  42    0
junio  22    11  21    0

In [81]:
df7.rename(index={'febrero':'feb', 'mayo':'may'}, columns={'SI':'PROG1'}, inplace=True)
df7

       BD  TEBD  PROG1  POO
enero  10     0     15   20
feb     5    15      5   35
marzo  33    21      1    3
abril  45    30     10   15
may    25    31     42    0
junio  22    11     21    0

In [82]:
df7.describe()

              BD       TEBD      PROG1        POO
count   6.000000   6.000000   6.000000   6.000000
mean   23.333333  18.000000  15.666667  12.166667
std    14.706008  11.865918  14.719601  13.934370
min     5.000000   0.000000   1.000000   0.000000
25%    13.000000  12.000000   6.250000   0.750000
50%    23.500000  18.000000  12.500000   9.000000
75%    31.000000  27.750000  19.500000  18.750000
max    45.000000  31.000000  42.000000  35.000000

In [83]:
df7['POO']

enero    20
feb      35
marzo     3
abril    15
may       0
junio     0
Name: POO, dtype: int64

In [84]:
df7['POO'].describe()

count     6.000000
mean     12.166667
std      13.934370
min       0.000000
25%       0.750000
50%       9.000000
75%      18.750000
max      35.000000
Name: POO, dtype: float64

In [85]:
sJAVA = df7['POO']
sJAVA

enero    20
feb      35
marzo     3
abril    15
may       0
junio     0
Name: POO, dtype: int64

In [86]:
df7[['POO','BD']]

       POO  BD
enero   20  10
feb     35   5
marzo    3  33
abril   15  45
may      0  25
junio    0  22

In [88]:
df7['marzo':'may'] #corte de listas

       BD  TEBD  PROG1  POO
marzo  33    21      1    3
abril  45    30     10   15
may    25    31     42    0

In [89]:
df7['marzo':'may']['POO']

marzo     3
abril    15
may       0
Name: POO, dtype: int64

In [90]:
df7['marzo':'may'][['POO','BD']]

       POO  BD
marzo    3  33
abril   15  45
may      0  25

In [91]:
df7[1:4]

       BD  TEBD  PROG1  POO
feb     5    15      5   35
marzo  33    21      1    3
abril  45    30     10   15

In [92]:
df7[::2]

       BD  TEBD  PROG1  POO
enero  10     0     15   20
marzo  33    21      1    3
may    25    31     42    0

In [93]:
df7['BD'][::2]

enero    10
marzo    33
may      25
Name: BD, dtype: int64

In [95]:
from datetime import datetime
df9 = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})

df9

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [96]:
df9.dtypes #tipos de elementos existentes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [97]:
df9.describe()

             saldo
count      3.00000
mean    6389.40000
std     4503.36464
min     2500.00000
25%     3922.50000
50%     5345.00000
75%     8334.10000
max    11323.20000

In [99]:
df9['saldo'].describe()

count        3.00000
mean      6389.40000
std       4503.36464
min       2500.00000
25%       3922.50000
50%       5345.00000
75%       8334.10000
max      11323.20000
Name: saldo, dtype: float64

In [100]:
df9.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [102]:
df9.astype(str).dtypes

nombres         object
fechas          object
saldo           object
al_corriente    object
dtype: object

In [103]:
df9['saldo'].astype(str)

0     2500.0
1     5345.0
2        nan
3    11323.2
Name: saldo, dtype: object

In [104]:
df9.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [107]:
df9['fechas'].astype("int64")

0    819504000000000000
1    600652800000000000
2    716428800000000000
3    742089600000000000
Name: fechas, dtype: int64

In [108]:
df9['saldo'] * 1.16

0     2900.000
1     6200.200
2          NaN
3    13134.912
Name: saldo, dtype: float64

In [110]:
df9['saldo_Iva'] = df9['saldo'] * 1.16
df9

            nombres     fechas    saldo  al_corriente  saldo_Iva
0        Juan Pérez 1995-12-21   2500.0          True   2900.000
1     María Sánchez 1989-01-13   5345.0          True   6200.200
2      Jorge Vargas 1992-09-14      NaN         False        NaN
3  Rodrigo Martínez 1993-07-08  11323.2          True  13134.912

In [112]:
df9.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
saldo_Iva              float64
dtype: object

In [115]:
df9['saldo_Iva'] = df9['saldo_Iva'].astype(str)
df9.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
saldo_Iva               object
dtype: object

In [119]:
df9['saldo_Iva'] * 2

0          2900.02900.0
1          6200.26200.2
2                nannan
3    13134.91213134.912
Name: saldo_Iva, dtype: object

In [120]:
df9['saldo'] * 12

0     30000.0
1     64140.0
2         NaN
3    135878.4
Name: saldo, dtype: float64